; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l7-t1-p3---int100n150-m25---int100c110---s47---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 - location
t0 - truck
p0 p1 p2 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level7 level7)
(sum level0 level15 level15)
(sum level0 level16 level16)
(sum level0 level23 level23)
(sum level0 level24 level24)
(sum level0 level25 level25)
(sum level1 level3 level4)
(sum level1 level7 level8)
(sum level1 level15 level16)
(sum level1 level16 level17)
(sum level1 level23 level24)
(sum level1 level24 level25)
(sum level1 level25 level26)
(sum level2 level3 level5)
(sum level2 level7 level9)
(sum level2 level15 level17)
(sum level2 level16 level18)
(sum level2 level23 level25)
(sum level2 level24 level26)
(sum level2 level25 level27)
(sum level3 level3 level6)
(sum level3 level7 level10)
(sum level3 level15 level18)
(sum level3 level16 level19)
(sum level3 level23 level26)
(sum level3 level24 level27)
(sum level3 level25 level28)
(sum level4 level3 level7)
(sum level4 level7 level11)
(sum level4 level15 level19)
(sum level4 level16 level20)
(sum level4 level23 level27)
(sum level4 level24 level28)
(sum level4 level25 level29)
(sum level5 level3 level8)
(sum level5 level7 level12)
(sum level5 level15 level20)
(sum level5 level16 level21)
(sum level5 level23 level28)
(sum level5 level24 level29)
(sum level5 level25 level30)
(sum level6 level3 level9)
(sum level6 level7 level13)
(sum level6 level15 level21)
(sum level6 level16 level22)
(sum level6 level23 level29)
(sum level6 level24 level30)
(sum level6 level25 level31)
(sum level7 level3 level10)
(sum level7 level7 level14)
(sum level7 level15 level22)
(sum level7 level16 level23)
(sum level7 level23 level30)
(sum level7 level24 level31)
(sum level7 level25 level32)
(sum level8 level3 level11)
(sum level8 level7 level15)
(sum level8 level15 level23)
(sum level8 level16 level24)
(sum level8 level23 level31)
(sum level8 level24 level32)
(sum level8 level25 level33)
(sum level9 level3 level12)
(sum level9 level7 level16)
(sum level9 level15 level24)
(sum level9 level16 level25)
(sum level9 level23 level32)
(sum level9 level24 level33)
(sum level9 level25 level34)
(sum level10 level3 level13)
(sum level10 level7 level17)
(sum level10 level15 level25)
(sum level10 level16 level26)
(sum level10 level23 level33)
(sum level10 level24 level34)
(sum level10 level25 level35)
(sum level11 level3 level14)
(sum level11 level7 level18)
(sum level11 level15 level26)
(sum level11 level16 level27)
(sum level11 level23 level34)
(sum level11 level24 level35)
(sum level11 level25 level36)
(sum level12 level3 level15)
(sum level12 level7 level19)
(sum level12 level15 level27)
(sum level12 level16 level28)
(sum level12 level23 level35)
(sum level12 level24 level36)
(sum level12 level25 level37)
(sum level13 level3 level16)
(sum level13 level7 level20)
(sum level13 level15 level28)
(sum level13 level16 level29)
(sum level13 level23 level36)
(sum level13 level24 level37)
(sum level13 level25 level38)
(sum level14 level3 level17)
(sum level14 level7 level21)
(sum level14 level15 level29)
(sum level14 level16 level30)
(sum level14 level23 level37)
(sum level14 level24 level38)
(sum level14 level25 level39)
(sum level15 level3 level18)
(sum level15 level7 level22)
(sum level15 level15 level30)
(sum level15 level16 level31)
(sum level15 level23 level38)
(sum level15 level24 level39)
(sum level15 level25 level40)
(sum level16 level3 level19)
(sum level16 level7 level23)
(sum level16 level15 level31)
(sum level16 level16 level32)
(sum level16 level23 level39)
(sum level16 level24 level40)
(sum level16 level25 level41)
(sum level17 level3 level20)
(sum level17 level7 level24)
(sum level17 level15 level32)
(sum level17 level16 level33)
(sum level17 level23 level40)
(sum level17 level24 level41)
(sum level17 level25 level42)
(sum level18 level3 level21)
(sum level18 level7 level25)
(sum level18 level15 level33)
(sum level18 level16 level34)
(sum level18 level23 level41)
(sum level18 level24 level42)
(sum level18 level25 level43)
(sum level19 level3 level22)
(sum level19 level7 level26)
(sum level19 level15 level34)
(sum level19 level16 level35)
(sum level19 level23 level42)
(sum level19 level24 level43)
(sum level19 level25 level44)
(sum level20 level3 level23)
(sum level20 level7 level27)
(sum level20 level15 level35)
(sum level20 level16 level36)
(sum level20 level23 level43)
(sum level20 level24 level44)
(sum level20 level25 level45)
(sum level21 level3 level24)
(sum level21 level7 level28)
(sum level21 level15 level36)
(sum level21 level16 level37)
(sum level21 level23 level44)
(sum level21 level24 level45)
(sum level21 level25 level46)
(sum level22 level3 level25)
(sum level22 level7 level29)
(sum level22 level15 level37)
(sum level22 level16 level38)
(sum level22 level23 level45)
(sum level22 level24 level46)
(sum level22 level25 level47)
(sum level23 level3 level26)
(sum level23 level7 level30)
(sum level23 level15 level38)
(sum level23 level16 level39)
(sum level23 level23 level46)
(sum level23 level24 level47)
(sum level23 level25 level48)
(sum level24 level3 level27)
(sum level24 level7 level31)
(sum level24 level15 level39)
(sum level24 level16 level40)
(sum level24 level23 level47)
(sum level24 level24 level48)
(sum level24 level25 level49)
(sum level25 level3 level28)
(sum level25 level7 level32)
(sum level25 level15 level40)
(sum level25 level16 level41)
(sum level25 level23 level48)
(sum level25 level24 level49)
(sum level25 level25 level50)
(sum level26 level3 level29)
(sum level26 level7 level33)
(sum level26 level15 level41)
(sum level26 level16 level42)
(sum level26 level23 level49)
(sum level26 level24 level50)
(sum level26 level25 level51)
(sum level27 level3 level30)
(sum level27 level7 level34)
(sum level27 level15 level42)
(sum level27 level16 level43)
(sum level27 level23 level50)
(sum level27 level24 level51)
(sum level27 level25 level52)
(sum level28 level3 level31)
(sum level28 level7 level35)
(sum level28 level15 level43)
(sum level28 level16 level44)
(sum level28 level23 level51)
(sum level28 level24 level52)
(sum level28 level25 level53)
(sum level29 level3 level32)
(sum level29 level7 level36)
(sum level29 level15 level44)
(sum level29 level16 level45)
(sum level29 level23 level52)
(sum level29 level24 level53)
(sum level29 level25 level54)
(sum level30 level3 level33)
(sum level30 level7 level37)
(sum level30 level15 level45)
(sum level30 level16 level46)
(sum level30 level23 level53)
(sum level30 level24 level54)
(sum level30 level25 level55)
(sum level31 level3 level34)
(sum level31 level7 level38)
(sum level31 level15 level46)
(sum level31 level16 level47)
(sum level31 level23 level54)
(sum level31 level24 level55)
(sum level31 level25 level56)
(sum level32 level3 level35)
(sum level32 level7 level39)
(sum level32 level15 level47)
(sum level32 level16 level48)
(sum level32 level23 level55)
(sum level32 level24 level56)
(sum level32 level25 level57)
(sum level33 level3 level36)
(sum level33 level7 level40)
(sum level33 level15 level48)
(sum level33 level16 level49)
(sum level33 level23 level56)
(sum level33 level24 level57)
(sum level33 level25 level58)
(sum level34 level3 level37)
(sum level34 level7 level41)
(sum level34 level15 level49)
(sum level34 level16 level50)
(sum level34 level23 level57)
(sum level34 level24 level58)
(sum level34 level25 level59)
(sum level35 level3 level38)
(sum level35 level7 level42)
(sum level35 level15 level50)
(sum level35 level16 level51)
(sum level35 level23 level58)
(sum level35 level24 level59)
(sum level35 level25 level60)
(sum level36 level3 level39)
(sum level36 level7 level43)
(sum level36 level15 level51)
(sum level36 level16 level52)
(sum level36 level23 level59)
(sum level36 level24 level60)
(sum level36 level25 level61)
(sum level37 level3 level40)
(sum level37 level7 level44)
(sum level37 level15 level52)
(sum level37 level16 level53)
(sum level37 level23 level60)
(sum level37 level24 level61)
(sum level37 level25 level62)
(sum level38 level3 level41)
(sum level38 level7 level45)
(sum level38 level15 level53)
(sum level38 level16 level54)
(sum level38 level23 level61)
(sum level38 level24 level62)
(sum level38 level25 level63)
(sum level39 level3 level42)
(sum level39 level7 level46)
(sum level39 level15 level54)
(sum level39 level16 level55)
(sum level39 level23 level62)
(sum level39 level24 level63)
(sum level39 level25 level64)
(sum level40 level3 level43)
(sum level40 level7 level47)
(sum level40 level15 level55)
(sum level40 level16 level56)
(sum level40 level23 level63)
(sum level40 level24 level64)
(sum level40 level25 level65)
(sum level41 level3 level44)
(sum level41 level7 level48)
(sum level41 level15 level56)
(sum level41 level16 level57)
(sum level41 level23 level64)
(sum level41 level24 level65)
(sum level41 level25 level66)
(sum level42 level3 level45)
(sum level42 level7 level49)
(sum level42 level15 level57)
(sum level42 level16 level58)
(sum level42 level23 level65)
(sum level42 level24 level66)
(sum level42 level25 level67)
(sum level43 level3 level46)
(sum level43 level7 level50)
(sum level43 level15 level58)
(sum level43 level16 level59)
(sum level43 level23 level66)
(sum level43 level24 level67)
(sum level43 level25 level68)
(sum level44 level3 level47)
(sum level44 level7 level51)
(sum level44 level15 level59)
(sum level44 level16 level60)
(sum level44 level23 level67)
(sum level44 level24 level68)
(sum level44 level25 level69)
(sum level45 level3 level48)
(sum level45 level7 level52)
(sum level45 level15 level60)
(sum level45 level16 level61)
(sum level45 level23 level68)
(sum level45 level24 level69)
(sum level46 level3 level49)
(sum level46 level7 level53)
(sum level46 level15 level61)
(sum level46 level16 level62)
(sum level46 level23 level69)
(sum level47 level3 level50)
(sum level47 level7 level54)
(sum level47 level15 level62)
(sum level47 level16 level63)
(sum level48 level3 level51)
(sum level48 level7 level55)
(sum level48 level15 level63)
(sum level48 level16 level64)
(sum level49 level3 level52)
(sum level49 level7 level56)
(sum level49 level15 level64)
(sum level49 level16 level65)
(sum level50 level3 level53)
(sum level50 level7 level57)
(sum level50 level15 level65)
(sum level50 level16 level66)
(sum level51 level3 level54)
(sum level51 level7 level58)
(sum level51 level15 level66)
(sum level51 level16 level67)
(sum level52 level3 level55)
(sum level52 level7 level59)
(sum level52 level15 level67)
(sum level52 level16 level68)
(sum level53 level3 level56)
(sum level53 level7 level60)
(sum level53 level15 level68)
(sum level53 level16 level69)
(sum level54 level3 level57)
(sum level54 level7 level61)
(sum level54 level15 level69)
(sum level55 level3 level58)
(sum level55 level7 level62)
(sum level56 level3 level59)
(sum level56 level7 level63)
(sum level57 level3 level60)
(sum level57 level7 level64)
(sum level58 level3 level61)
(sum level58 level7 level65)
(sum level59 level3 level62)
(sum level59 level7 level66)
(sum level60 level3 level63)
(sum level60 level7 level67)
(sum level61 level3 level64)
(sum level61 level7 level68)
(sum level62 level3 level65)
(sum level62 level7 level69)
(sum level63 level3 level66)
(sum level64 level3 level67)
(sum level65 level3 level68)
(sum level66 level3 level69)

(connected l0 l1)
(fuelcost level15 l0 l1)
(connected l0 l2)
(fuelcost level25 l0 l2)
(connected l0 l3)
(fuelcost level25 l0 l3)
(connected l0 l4)
(fuelcost level24 l0 l4)
(connected l0 l5)
(fuelcost level3 l0 l5)
(connected l1 l0)
(fuelcost level15 l1 l0)
(connected l1 l3)
(fuelcost level7 l1 l3)
(connected l2 l0)
(fuelcost level25 l2 l0)
(connected l2 l3)
(fuelcost level16 l2 l3)
(connected l3 l0)
(fuelcost level25 l3 l0)
(connected l3 l1)
(fuelcost level7 l3 l1)
(connected l3 l2)
(fuelcost level16 l3 l2)
(connected l3 l4)
(fuelcost level25 l3 l4)
(connected l4 l0)
(fuelcost level24 l4 l0)
(connected l4 l3)
(fuelcost level25 l4 l3)
(connected l4 l5)
(fuelcost level23 l4 l5)
(connected l5 l0)
(fuelcost level3 l5 l0)
(connected l5 l4)
(fuelcost level23 l5 l4)
(connected l5 l6)
(fuelcost level15 l5 l6)
(connected l6 l5)
(fuelcost level15 l6 l5)

(at t0 l1)
(fuel t0 level69)
(= (total-cost) 0)

(at p0 l0)
(at p1 l3)
(at p2 l0)
)

(:goal
(and
(at p0 l2)
(at p1 l1)
(at p2 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l1 l0 level54 level15 level69)
   deleted: (at t0 l1) (fuel t0 level69)
   added: (at t0 l0) (fuel t0 level54)
   goals met: 0 of 3
2. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 3
3. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 3
4. (drive t0 l0 l2 level29 level25 level54)
   deleted: (at t0 l0) (fuel t0 level54)
   added: (at t0 l2) (fuel t0 level29)
   goals met: 0 of 3
5. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 1 of 3
6. (drive t0 l2 l3 level13 level16 level29)
   deleted: (at t0 l2) (fuel t0 level29)
   added: (at t0 l3) (fuel t0 level13)
   goals met: 1 of 3
7. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 1 of 3
8. (drive t0 l3 l1 level6 level7 level13)
   deleted: (at t0 l3) (fuel t0 level13)
   added: (at t0 l1) (fuel t0 level6)
   goals met: 1 of 3
9. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 2 of 3
10. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 3 of 3
